#include "mbed.h"

PwmOut buzzer(PB_3); // D3

/*
    쉼표(8), 미(8), 미(8), 파(8), 솔(4), 라(8), 시(8)
    높레(8), 높도(8), 높도(16), 시(16), 높도(8), 솔(8), 솔(8) 솔(8) 솔(8)
    솔(4) 라(8) 라(2) 라(8)
    솔(8) 파(8) 미(8) 레(8) 레(2)
    쉼표(8), 미(8) 미(8) 파(8) 솔(8) 솔(8) 라(8) 시(8)
    높레(8) 높도(8) 높레(8) 높미(8) 높미(2) 
    쉼표(8) X 8
    쉼표(8) 높레(4) 라(8) 높도(4) 시(4)
    높도(1) + 쉼표(4)
*/

int beat[] = {
    8, 8, 8, 8, 16, 8, 8,
    8, 8, 4, 4, 8, 16, 8, 8,
    16, 8, 40,
    8, 8, 8, 40,
    8, 8, 8, 8, 8, 8, 8, 8, 
    8, 8, 8, 40,
    8, 8, 8, 8, 8, 8, 8, 8,
    8, 16, 8, 16, 16,
    48, 16
} ; // beat array[1,...,16], 1 beat = 1 / 16 sec 
float freq[] = {
    100000, 329.63, 329.63, 349.23, 392, 440, 493.88, // 7
    587.33, 523.25, 523.25, 493.88, 523.25, 392, 392, 392, // 8
    392, 440, 440, // 3
    392, 349.23, 329.63, 293.66, // 4
    100000, 329.63, 329.63, 349.23, 392, 392, 440, 493.88, // 8
    587.33, 523.25, 587.33, 659.26, // 4
    100000, 100000, 100000, 100000, 100000, 100000, 100000, 100000, // 8
    100000, 587.33, 440, 523.25, 493.38, // 5
    523.25, 100000 // 2 
};

int main()
{
    int period_us ; 
    int beat_ms ; 
        
    while (true) { 
         for (int i = 0 ; i < sizeof(freq)/sizeof(float); i++){ 
            buzzer = 1.0 - 0.1 ;  // set duty cycle (1.0 - 0.1) 
                
            period_us = 1000000 / freq[i] ; 
            beat_ms = 62.5 * beat[i] ; 
                
            buzzer.period_us(period_us) ; // set PWM period 
            ThisThread::sleep_for(chrono::milliseconds(beat_ms)) ; // hold for beat period
                
            buzzer = 1.0 ;
            ThisThread::sleep_for(chrono::milliseconds(100)); 
         } 
    }  
}
